Useful methods & operations

unique(), nunique(), value_counts(), sort_values(), apply(), index, column

functions have () brackets, but attributes doesn't have any brackets

In [1]:
import numpy as np
import pandas as pd

In [2]:
import warnings
warnings.filterwarnings('ignore')

In [3]:
data_dict = {
    'col_1': [1,2,3,4,5],
    'col_2': [111,222,333,111,555],
    'col_3': ['alpha','bravo','charlie',np.nan,np.nan]
}
df = pd.DataFrame(data=data_dict)
df

   col_1  col_2    col_3
0      1    111    alpha
1      2    222    bravo
2      3    333  charlie
3      4    111      NaN
4      5    555      NaN

In [4]:
df['col_1']

0    1
1    2
2    3
3    4
4    5
Name: col_1, dtype: int64

In [5]:
df['col_1'].unique()

array([1, 2, 3, 4, 5])

In [6]:
df['col_2']

0    111
1    222
2    333
3    111
4    555
Name: col_2, dtype: int64

In [7]:
df['col_2'].unique()

array([111, 222, 333, 555])

In [8]:
len(df['col_2'])

5

In [9]:
len(df['col_2'].unique())

4

In [10]:
df['col_3']

0      alpha
1      bravo
2    charlie
3        NaN
4        NaN
Name: col_3, dtype: object

In [11]:
len(df['col_3'])

5

In [12]:
df['col_3'].unique()

array(['alpha', 'bravo', 'charlie', nan], dtype=object)

In [13]:
len(df['col_3'].unique())

4

In [14]:
df['col_1'].nunique()

5

In [15]:
df['col_2'].nunique()

4

In [16]:
df['col_3'].nunique()

3

In [17]:
df[['col_1', 'col_2', 'col_3']].nunique()

col_1    5
col_2    4
col_3    3
dtype: int64

In [18]:
df['col_1'].value_counts()

col_1
1    1
2    1
3    1
4    1
5    1
Name: count, dtype: int64

In [19]:
df

   col_1  col_2    col_3
0      1    111    alpha
1      2    222    bravo
2      3    333  charlie
3      4    111      NaN
4      5    555      NaN

In [20]:
df['col_2'].value_counts()

col_2
111    2
222    1
333    1
555    1
Name: count, dtype: int64

In [21]:
df['col_3'].value_counts()

col_3
alpha      1
bravo      1
charlie    1
Name: count, dtype: int64

In [22]:
df

   col_1  col_2    col_3
0      1    111    alpha
1      2    222    bravo
2      3    333  charlie
3      4    111      NaN
4      5    555      NaN

sort_values()

1. ascending=True
2. inplace=False

In [23]:
df

   col_1  col_2    col_3
0      1    111    alpha
1      2    222    bravo
2      3    333  charlie
3      4    111      NaN
4      5    555      NaN

In [24]:
df.sort_values(by='col_1')

   col_1  col_2    col_3
0      1    111    alpha
1      2    222    bravo
2      3    333  charlie
3      4    111      NaN
4      5    555      NaN

In [25]:
df

   col_1  col_2    col_3
0      1    111    alpha
1      2    222    bravo
2      3    333  charlie
3      4    111      NaN
4      5    555      NaN

In [26]:
df.sort_values(by='col_2')

   col_1  col_2    col_3
0      1    111    alpha
3      4    111      NaN
1      2    222    bravo
2      3    333  charlie
4      5    555      NaN

In [27]:
df.sort_values(by='col_3')

   col_1  col_2    col_3
0      1    111    alpha
1      2    222    bravo
2      3    333  charlie
3      4    111      NaN
4      5    555      NaN

In [28]:
df

   col_1  col_2    col_3
0      1    111    alpha
1      2    222    bravo
2      3    333  charlie
3      4    111      NaN
4      5    555      NaN

In [29]:
df.sort_values(by='col_2')

   col_1  col_2    col_3
0      1    111    alpha
3      4    111      NaN
1      2    222    bravo
2      3    333  charlie
4      5    555      NaN

In [30]:
df.sort_values(by='col_2', ascending=False)

   col_1  col_2    col_3
4      5    555      NaN
2      3    333  charlie
1      2    222    bravo
0      1    111    alpha
3      4    111      NaN

apply()

In [31]:
# user defined function
def square(value):
    return value * value

In [32]:
df

   col_1  col_2    col_3
0      1    111    alpha
1      2    222    bravo
2      3    333  charlie
3      4    111      NaN
4      5    555      NaN

In [33]:
df['col_1'].apply(square)

0     1
1     4
2     9
3    16
4    25
Name: col_1, dtype: int64

In [34]:
df

   col_1  col_2    col_3
0      1    111    alpha
1      2    222    bravo
2      3    333  charlie
3      4    111      NaN
4      5    555      NaN

In [35]:
df['col_2'].apply(square)

0     12321
1     49284
2    110889
3     12321
4    308025
Name: col_2, dtype: int64

In [36]:
df

   col_1  col_2    col_3
0      1    111    alpha
1      2    222    bravo
2      3    333  charlie
3      4    111      NaN
4      5    555      NaN

In [37]:
df[['col_1', 'col_2']].apply(square)

   col_1   col_2
0      1   12321
1      4   49284
2      9  110889
3     16   12321
4     25  308025

In [38]:
df['col_1'].apply(lambda value:value*value)

0     1
1     4
2     9
3    16
4    25
Name: col_1, dtype: int64

attributes

attributes doesn't have any brackets

In [39]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [40]:
df.columns

Index(['col_1', 'col_2', 'col_3'], dtype='object')

In [41]:
df

   col_1  col_2    col_3
0      1    111    alpha
1      2    222    bravo
2      3    333  charlie
3      4    111      NaN
4      5    555      NaN

In [42]:
newdf = df.copy()

In [43]:
newdf

   col_1  col_2    col_3
0      1    111    alpha
1      2    222    bravo
2      3    333  charlie
3      4    111      NaN
4      5    555      NaN

In [44]:
aa = newdf

In [45]:
aa

   col_1  col_2    col_3
0      1    111    alpha
1      2    222    bravo
2      3    333  charlie
3      4    111      NaN
4      5    555      NaN

In [46]:
del aa['col_1']

In [47]:
aa

   col_2    col_3
0    111    alpha
1    222    bravo
2    333  charlie
3    111      NaN
4    555      NaN

In [48]:
df

   col_1  col_2    col_3
0      1    111    alpha
1      2    222    bravo
2      3    333  charlie
3      4    111      NaN
4      5    555      NaN

In [49]:
aa

   col_2    col_3
0    111    alpha
1    222    bravo
2    333  charlie
3    111      NaN
4    555      NaN

In [50]:
newdf

   col_2    col_3
0    111    alpha
1    222    bravo
2    333  charlie
3    111      NaN
4    555      NaN

In [51]:
aa = df.copy()

In [52]:
aa

   col_1  col_2    col_3
0      1    111    alpha
1      2    222    bravo
2      3    333  charlie
3      4    111      NaN
4      5    555      NaN

In [53]:
newdf

   col_2    col_3
0    111    alpha
1    222    bravo
2    333  charlie
3    111      NaN
4    555      NaN

In [54]:
newdf['dd'] = 2

In [55]:
newdf

   col_2    col_3  dd
0    111    alpha   2
1    222    bravo   2
2    333  charlie   2
3    111      NaN   2
4    555      NaN   2

In [56]:
aa

   col_1  col_2    col_3
0      1    111    alpha
1      2    222    bravo
2      3    333  charlie
3      4    111      NaN
4      5    555      NaN

In [57]:
newdf

   col_2    col_3  dd
0    111    alpha   2
1    222    bravo   2
2    333  charlie   2
3    111      NaN   2
4    555      NaN   2

In [58]:
newdf.insert(1, 'new-col2', [1,2,3,4,5])
newdf

   col_2  new-col2    col_3  dd
0    111         1    alpha   2
1    222         2    bravo   2
2    333         3  charlie   2
3    111         4      NaN   2
4    555         5      NaN   2

In [59]:
newdf

   col_2  new-col2    col_3  dd
0    111         1    alpha   2
1    222         2    bravo   2
2    333         3  charlie   2
3    111         4      NaN   2
4    555         5      NaN   2

In [60]:
newdf['dd'] = newdf['col_2'] * newdf['new-col2']
newdf

   col_2  new-col2    col_3    dd
0    111         1    alpha   111
1    222         2    bravo   444
2    333         3  charlie   999
3    111         4      NaN   444
4    555         5      NaN  2775

In [61]:
newdf['dd'] = 11

In [62]:
newdf

   col_2  new-col2    col_3  dd
0    111         1    alpha  11
1    222         2    bravo  11
2    333         3  charlie  11
3    111         4      NaN  11
4    555         5      NaN  11